holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Cleanup
    lv_textarea_set_text(kb_user_data->ta, "");
    lv_obj_add_flag(kb_user_data->kb, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(kb_user_data->ta, LV_OBJ_FLAG_HIDDEN);
    lv_obj_set_user_data(kb_user_data->ta, NULL);  // Clear tracking
}

/** ---------------------------------------------------------------------------------------
 * @brief Event callback for ALL menu_x child objects (buttons, items, containers).
 * @param e Pointer to the LVGL event structure.
 */
static void menu_x_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    
    if(code == LV_EVENT_CLICKED) {
        lv_obj_t * obj = (lv_obj_t *)lv_event_get_target(e);     // Get clicked object
        lv_obj_t * label = lv_obj_get_child(obj, 0); // Get object's label (if any)
        
        // Find which page this object belongs to
        int page_index = -1;
        for(int p = 0; p < menu_x.page_count; p++) {
            uint32_t child_cnt = lv_obj_get_child_cnt(menu_x.pages[p]);
            for(uint32_t i = 0; i < child_cnt; i++) {
                if(lv_obj_get_child(menu_x.pages[p], i) == obj) {
                    page_index = p;
                    uint32_t item_index = i;
                    
                    const char * text = label ? lv_label_get_text(label) : "no label";
                    printf("Menu X: Page %d, Item %lu (%s) clicked!\n", 
                           page_index, item_index, text);
                    
                    // Your custom logic
                    // handle_menu_item_click(page_index, item_index, obj);
                    return;
                }
            }
        }
        
        printf("Menu X: Unknown object clicked\n");
    }
}

/** ---------------------------------------------------------------------------------------
 * @brief Event callback for grid_menu object click event.
 * @param e Pointer to the LVGL event structure.
 */
static void system_tray_grid_menu_1_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {

        lv_obj_t * btn = (lv_obj_t *)lv_event_get_target(e);     // Get clicked button
        lv_obj_t * grid = (lv_obj_t *)lv_event_get_user_data(e); // Get grid container (if passed)
        lv_obj_t * label = lv_obj_get_child(btn, 0); // Get button's label
        
        uint32_t btn_index = 0;
        uint32_t child_cnt = lv_obj_get_child_cnt(system_tray.grid_menu_1);
        for(uint32_t i = 0; i < child_cnt; i++) {
            if(lv_obj_get_child(system_tray.grid_menu_1, i) == btn) {
                btn_index = i;
                break;
            }
        }
        
        const char * text = lv_label_get_text(label);
        printf("System Tray Grid Menu 1: Button %lu (%s) clicked!\n", btn_index, text);
        
        // Switch logic
        switch(btn_index) {
            case 0:  flag_display_home_screen=true; break;
            case 1:  flag_display_matrix_screen=true; break;
            case 2:  flag_display_gps_screen=true; break;
            case 3:  flag_display_gyro_screen=true; break;
            case 4:  flag_display_disp_screen=true; break;
            case 5:  flag_display_system_screen=true; break;
            case 6:  flag_display__screen=true; break;
            default: break;
        }
    }
}

/** ---------------------------------------------------------------------------------------
 * @brief Event callback for grid_menu_x object click event.
 * @param e Pointer to the LVGL event structure.
 */
static void matrix_overview_grid_1_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {

        lv_obj_t * btn = (lv_obj_t *)lv_event_get_target(e);     // Get clicked button
        lv_obj_t * grid = (lv_obj_t *)lv_event_get_user_data(e); // Get grid container (if passed)
        lv_obj_t * label = lv_obj_get_child(btn, 0); // Get button's label
        
        uint32_t btn_index = 0;
        uint32_t child_cnt = lv_obj_get_child_cnt(matrix_overview_grid_1);
        for(uint32_t i = 0; i < child_cnt; i++) {
            if(lv_obj_get_child(matrix_overview_grid_1, i) == btn) {
                btn_index = i;
                break;
            }
        }
        
        const char * text = lv_label_get_text(label);
        printf("Matrix Overview Grid 1: Button %lu (%s) clicked!\n", btn_index, text);
        
        if (btn_index <= 44) {current_matrix_i = btn_index;}
    }
}

/** ---------------------------------------------------------------------------------------
 * @brief Event callback for drop_down_menu_x object click event.
 * @param e Pointer to the LVGL event structure.
 */
static void dropdown_menu_x_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    
    if(code == LV_EVENT_CLICKED) {
        lv_obj_t * option = (lv_obj_t *)lv_event_get_target(e);
        lv_obj_t * dropdown = (lv_obj_t *)lv_event_get_user_data(e);
        lv_obj_t * label = lv_obj_get_child(option, 0);
        
        uint32_t option_index = 0;
        uint32_t child_cnt = lv_obj_get_child_cnt(drop_down_menu_x);
        for(uint32_t i = 0; i < child_cnt; i++) {
            if(lv_obj_get_child(drop_down_menu_x, i) == option) {
                option_index = i;
                break;
            }
        }
        
        const char * text = lv_label_get_text(label);
        printf("Dropdown: Option %lu (%s) clicked!\n", option_index, text);
        
        // Custom logic
        switch(option_index) {
            case 0: /* Option 1 */ break;
            case 1: /* Option 2 */ break;
            // ...
        }
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_function_index_select dropdown.
 * 
 * Sets current_matrix_function_i based on dropdown selection.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_function_index_select_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        current_matrix_function_i = (int)sel;
        printf("[dd_function_index_select_event_cb] Function index set to: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_switch_index_select_event_cb dropdown.
 * 
 * Sets current_matrix_function_i based on dropdown selection.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_switch_index_select_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        current_matrix_i = (int)sel;
        printf("[dd_switch_index_select_event_cb] Switch index set to: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_current_map_slot_event_cb dropdown.
 * 
 * Sets current_matrix_function_i based on dropdown selection.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_current_map_slot_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        current_mapping_i = (int)sel;
        printf("[dd_current_map_slot_event_cb] Map slot index set to: %ld\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_function_name dropdown.
 * 
 * Sets matrixData.matrix_function based on dropdown selection.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_function_name_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.matrix_function[0][current_matrix_i][current_matrix_function_i] = (int)sel;
        printf("[dd_function_name_event_cb] Function set to: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_c0_event_cb dropdown.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_c0_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C0] = (int)sel;
        printf("[dd_c0_event_cb] Set map function: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_mode_event_cb dropdown.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_mode_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        mappingData.map_mode[0][matrixData.index_mapped_value[0][current_matrix_i]] = (int)sel;
        printf("[dd_mode_event_cb] Set map mode: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_mode_x_event_cb dropdown.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_mode_x_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        // Safety: Reset to 0
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]=0;
        // Set mode
        matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X] = (int)sel;
        printf("[dd_mode_x_event_cb] Set mode x: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_mode_y_event_cb dropdown.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_mode_y_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        // Safety: Reset to 0
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]=0;
        // Set mode
        matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y] = (int)sel;
        printf("[dd_mode_y_event_cb] Set mode y: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_mode_z_event_cb dropdown.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_mode_z_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        // Safety: Reset to 0
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]=0;
        // Set mode
        matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z] = (int)sel;
        printf("[dd_mode_z_event_cb] Set mode z: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_x_event_cb dropdown.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_x_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X] = (int)sel;
        printf("[dd_x_event_cb] Function X set to value index: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_y_event_cb dropdown.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_y_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y] = (int)sel;
        printf("[dd_y_event_cb] Function Y set to value index: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_z_event_cb dropdown.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_z_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z] = (int)sel;
        printf("[dd_z_event_cb] Function Z set to value index: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_operator dropdown.
 * 
 * Sets matrixData.matrix_switch_operator_index based on dropdown selection.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_operator_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.matrix_switch_operator_index[0][current_matrix_i][current_matrix_function_i] = (int)sel;
        printf("[dd_operator_event_cb] Operator set to: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_output_mode dropdown.
 * 
 * Sets matrixData.output_mode based on dropdown selection.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_output_mode_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.output_mode[0][current_matrix_i] = (int)sel;
        printf("[dd_output_mode_event_cb] Output mode set to: %lu\n", sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_matrix_file_slot_select_event_cb dropdown.
 * 
 * Sets current matrix file path based on dropdown selection.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_matrix_file_slot_select_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        memset(satioFileData.current_matrix_filepath, 0, sizeof(satioFileData.current_matrix_filepath));
        lv_dropdown_get_selected_str(dd_matrix_file_slot_select, satioFileData.current_matrix_filepath, sizeof(satioFileData.current_matrix_filepath));
        // strcpy(satioFileData.current_matrix_filepath, lv_dropdown_get_selected_str(dd_matrix_file_slot_select));
        printf("[dd_matrix_file_slot_select_event_cb] Matrix slot set to: %s\n", satioFileData.current_matrix_filepath);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for dd_link_map_slot_event_cb dropdown.
 * 
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void dd_link_map_slot_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if(code == LV_EVENT_VALUE_CHANGED) {
        lv_obj_t * dd = (lv_obj_t *)lv_event_get_target(e);
        uint32_t sel = lv_dropdown_get_selected(dd);
        matrixData.index_mapped_value[0][current_matrix_i] = (int)sel;
        printf("[dd_link_map_slot_event_cb] Matrix %d will use map slot: %ld\n", current_matrix_i, sel);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for matrix_new_event_cb switch.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void matrix_new_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[matrix_new_event_cb] event code: %d\n", code);}

