holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if(code == LV_EVENT_CLICKED) {
        printf("[matrix_new_event_cb] Setting new matrix.\n");
        override_all_computer_assists();
        set_all_matrix_default();
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for matrix_save_event_cb switch.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void matrix_save_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[matrix_save_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        if (sdcardData.sdcard_mounted==true) {
            printf("[matrix_save_event_cb] Saving matrix to slot: %s\n", satioFileData.current_matrix_filepath);
            sdcardFlagData.save_matrix=true;
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            sdcardFlagData.save_mapping=true;
        }
        else {
            printf("[matrix_save_event_cb] sdcard is not mounted.");
        }
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for matrix_load_event_cb switch.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void matrix_load_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[matrix_load_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        if (sdcardData.sdcard_mounted==true) {
            printf("[matrix_load_event_cb] Loading matrix from slot: %s\n", satioFileData.current_matrix_filepath);
            sdcardFlagData.load_mapping=true;
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            sdcardFlagData.load_matrix=true;
        }
        else {
            printf("[matrix_load_event_cb] sdcard is not mounted.");
        }
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for matrix_delete_event_cb switch.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void matrix_delete_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[matrix_delete_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        if (sdcardData.sdcard_mounted==true) {
            printf("[matrix_delete_event_cb] Deleting matrix in slot: %s\n", satioFileData.current_matrix_filepath);
            sdcardFlagData.delete_matrix=true;
        }
        else {
            printf("[matrix_delete_event_cb] sdcard is not mounted.");
        }
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for current_matrix_computer_assist_event_cb switch.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void current_matrix_computer_assist_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[current_matrix_computer_assist_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        bool toggle = !matrixData.computer_assist[0][current_matrix_i];
        matrixData.computer_assist[0][current_matrix_i] = toggle;
        printf("[current_matrix_computer_assist_event_cb] Setting computer assist for matrix switch %d to: %s\n", current_matrix_i, toggle ? "true" : "false");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for switch_matrix_mapping_panel_event_cb switch.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void switch_matrix_mapping_panel_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[switch_matrix_mapping_panel_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        current_matrix_panel_view+=1;
        if (current_matrix_panel_view>=MAX_MATRIX_PANEL_VIEWS) {current_matrix_panel_view=0;}
        printf("[switch_matrix_mapping_panel_event_cb] Switching matrix panel view: %d\n", current_matrix_panel_view);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback for current_matrix_override_off_event_cb switch.
 * 
 * @param e Pointer to the LVGL event structure.
 */
static void current_matrix_override_off_event_cb(lv_event_t * e) {
    lv_event_code_t code = lv_event_get_code(e);
    if
    (
        code == LV_EVENT_CLICKED ||
        code == LV_EVENT_PRESSED ||
        code == LV_EVENT_RELEASED
    ) {printf("[current_matrix_override_off_event_cb] event code: %d\n", code);}

    if(code == LV_EVENT_CLICKED) {
        printf("[current_matrix_override_off_event_cb] OVERRIDING matrix switch %d\n", current_matrix_i);
        setOverrideOutputValue((int)current_matrix_i, (uint32_t)0);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Create Slider
 */
lv_obj_t * create_slider(
    lv_obj_t * scr,
    int32_t size_w_px,
    int32_t size_h_px,
    int32_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    int32_t range_min,
    int32_t range_max,
    int32_t range_value
    )
{
    /*----------------------------------------------- SLIDER -----------------------------------------------*/

    // Create slider
    lv_obj_t * slider = lv_slider_create(scr);

