holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Main style: text
    lv_obj_set_style_text_align(result.ta, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.ta, font_menu_item, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.ta, menu_text_color, LV_PART_MAIN);

    return result;
}

/** -----------------------------------------------------------------------------------------------
 * @brief Create Menu Item.
 * 
 * Intention is to be resusable, flexible & while providing a consistent style.
 * 
 * @param menu_page Pointer to the parent menu_x object.
 * @param title Title of the menu_x page.
 * @return Pointer to the created menu_x page object.
 */
void create_menu_item(menu_struct * menu, int page_index, const char * title) {

    /*--------------------------------------------- CONTAINER -----------------------------------------------*/

    // Create container
    lv_obj_t * container = lv_menu_cont_create(menu->pages[page_index]);

    /*-------------------------------------- CONTAINER LV_PART_MAIN -----------------------------------------*/
    
    // Size and position
    lv_obj_set_style_pad_hor(container, 2, LV_PART_MAIN);
    lv_obj_set_style_pad_ver(container, 4, LV_PART_MAIN);
    lv_obj_set_width(container, lv_pct(80));

    // Main style: radius
    lv_obj_set_style_radius(container, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(container, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(container, lv_color_make(0,0,0), LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(container, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(container, menu_border_color, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(container, menu_bg_color, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(container, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(container, menu_shadow_color, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(container, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(container, font_menu_item, LV_PART_MAIN);
    lv_obj_set_style_text_color(container, menu_text_color, LV_PART_MAIN);

    /*----------------------------------------------- LABEL -----------------------------------------------*/
    
    // Create label
    lv_obj_t * label = lv_label_create(container);

    /* --- LABEL LV_PART_MAIN ---------------------------------------------------------- */

    // Size and position
    lv_obj_set_style_pad_hor(label, 8, LV_PART_MAIN);
    lv_obj_set_style_pad_ver(label, 8, LV_PART_MAIN);
    lv_obj_set_width(label, lv_pct(100));

    // Main style: radius
    lv_obj_set_style_radius(label, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(label, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(label, lv_color_make(0,0,0), LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(label, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(label, menu_border_color, LV_PART_MAIN);
    
    // Main style: background
    lv_obj_set_style_bg_color(label, menu_bg_color, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(label, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(label, menu_shadow_color, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(label, menu_text_color, LV_PART_MAIN);
    lv_obj_set_style_text_font(label, font_menu_item, LV_PART_MAIN);
    lv_label_set_text(label, title);

    /* --- ADD TO MENU ----------------------------------------------------------------- */
    
    // Add to menu struct
    if(menu->page_item_counts[page_index] < menu->max_items_per_page) {
        menu->page_items[page_index][menu->page_item_counts[page_index]] = container;
        menu->page_item_counts[page_index]++;
    }
}

/** -----------------------------------------------------------------------------------------------
 * @brief Create Menu Page.
 * 
 * Intention is to be resusable, flexible & while providing a consistent style.
 * 
 * @param menu_x Pointer to the parent menu_x object.
 * @param title Title of the menu_x page.
 * @return Pointer to the created menu_x page object.
 */
lv_obj_t * create_menu_page(lv_obj_t * menu_x, const char * title) {

    /* --- MENU ------------------------------------------------------------------------ */

    // Create menu
    lv_obj_t * menu_page = lv_menu_page_create(menu_x, title);

    /* --- MENU LV_PART_MAIN ----------------------------------------------------------- */

    // Size and position
    lv_obj_set_style_pad_row(menu_page, 2, LV_PART_MAIN);
    lv_obj_set_style_pad_column(menu_page, 2, LV_PART_MAIN);

    // Main style: radius
    lv_obj_set_style_radius(menu_page, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(menu_page, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(menu_page, lv_color_make(0,0,0), LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(menu_page, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(menu_page, menu_border_color, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(menu_page, menu_bg_color, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(menu_page, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(menu_page, menu_shadow_color, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(menu_page, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(menu_page, menu_text_color, LV_PART_MAIN);
    lv_obj_set_style_text_font(menu_page, font_menu_item, LV_PART_MAIN);

    return menu_page;
}

/** -----------------------------------------------------------------------------------------------
 * @brief Create Menu
 * 
 * Intention is to be resusable, flexible & while providing a consistent style.
 * 
 * @param scr Pointer to the parent screen object.
 * @param max_pages Maximum number of pages in the menu.
 * @param page_titles Array of page titles (NULL-terminated).
 * @param main_menu_items Array of main menu item titles (NULL-terminated).
 * @param size_w_px Width of the menu in pixels.
 * @param size_h_px Height of the menu in pixels.
 * @param alignment Alignment of the menu within its parent/screen.
 * @param pos_x X position of the menu within its parent/screen.
 * @param pos_y Y position of the menu within its parent/screen.
 * 
 */
menu_struct create_menu(
    lv_obj_t *scr,
    int max_pages,
    const char ** page_titles,
    const char ** main_menu_items,
    int32_t size_w_px,
    int32_t size_h_px,
    int32_t alignment,
    int32_t pos_x,
    int32_t pos_y
    )
{
    /* --- MENU ------------------------------------------------------------------------ */

    // Create a new menu_struct
    menu_struct result = {0};
    
