holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.ta_c2 = create_textarea(
        row4,     // lv_obj_t
        value_width_0,             // width px
        row_height,              // height px
        LV_ALIGN_CENTER, // alignment
        0,            // pos x
        0,              // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_c2, String(mappingData.mapping_config[0][current_matrix_i][INDEX_MAP_C2]).c_str());
    lv_obj_add_event_cb(result.ta_c2, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_c2, &mapping_c2_ctx);

    // Critical for alignment
    lv_obj_set_size(result.c2, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.ta_c2, value_width_0, LV_SIZE_CONTENT);

    /* --- ROW 5: C3 Value ------------------------------------------------------------- */
    
    lv_obj_t * row5 = lv_obj_create(result.panel);
    lv_obj_set_size(row5, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row5, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row5, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row5, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row5, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row5, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row5,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row5, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row5, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row5, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row5, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding*2;
    label_width_1 = NULL;
    value_width_1 = NULL;
    
    result.c3 = lv_label_create(row5);
    lv_label_set_text(result.c3, "C3");
    lv_obj_set_size(result.c3, label_width_0, row_height);
    lv_obj_set_style_text_font(result.c3, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.c3, menu_text_color, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.c3, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    result.ta_c3 = create_textarea(
        row5,     // lv_obj_t
        value_width_0,             // width px
        row_height,              // height px
        LV_ALIGN_CENTER, // alignment
        0,            // pos x
        0,              // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_c3, String(mappingData.mapping_config[0][current_matrix_i][INDEX_MAP_C3]).c_str());
    lv_obj_add_event_cb(result.ta_c3, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_c3, &mapping_c3_ctx);

    // Critical for alignment
    lv_obj_set_size(result.c3, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.ta_c3, value_width_0, LV_SIZE_CONTENT);
    
    /* --- ROW 6: C4 Value ------------------------------------------------------------ */
    
    lv_obj_t * row6 = lv_obj_create(result.panel);
    lv_obj_set_size(row6, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row6, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row6, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row6, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row6, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row6, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row6,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row6, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row6, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row6, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row6, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding*2;
    label_width_1 = NULL;
    value_width_1 = NULL;
    
    result.c4 = lv_label_create(row6);
    lv_label_set_text(result.c4, "C4");
    lv_obj_set_size(result.c4, label_width_0, row_height);
    lv_obj_set_style_text_font(result.c4, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.c4, menu_text_color, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.c4, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    result.ta_c4 = create_textarea(
        row6,     // lv_obj_t
        value_width_0,             // width px
        row_height,              // height px
        LV_ALIGN_CENTER, // alignment
        0,            // pos x
        0,              // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_c4, String(mappingData.mapping_config[0][current_matrix_i][INDEX_MAP_C4]).c_str());
    lv_obj_add_event_cb(result.ta_c4, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_c4, &mapping_c4_ctx);

    // Critical for alignment
    lv_obj_set_size(result.c4, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.ta_c4, value_width_0, LV_SIZE_CONTENT);
    
    /* --- ROW 7: Map Mode ---------------------------------------------------------- */
    
