holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_t * row7 = lv_obj_create(result.panel);
    lv_obj_set_size(row7, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row7, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row7, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row7, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row7, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row7, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row7,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row7, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row7, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row7, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row7, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding*2;
    label_width_1 = NULL;
    value_width_1 = NULL;

    result.c5 = lv_label_create(row7);
    lv_label_set_text(result.c5, "C5");
    lv_obj_set_size(result.c5, label_width_0, row_height);
    lv_obj_set_style_text_font(result.c5, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.c5, menu_text_color, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.c5, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    result.ta_c5 = create_textarea(
        row7,     // lv_obj_t
        value_width_0,             // width px
        row_height,              // height px
        LV_ALIGN_CENTER, // alignment
        0,            // pos x
        0,              // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_c5, String(mappingData.mapping_config[0][matrixData.index_mapped_value[0][current_matrix_i]][INDEX_MAP_C5]).c_str());
    lv_obj_add_event_cb(result.ta_c5, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_c5, &mapping_c5_ctx);

    // Critical for alignment
    lv_obj_set_size(result.c5, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.ta_c5, value_width_0, LV_SIZE_CONTENT);
    
    /* --- ROW 8: Map Mode --------------------------------------------------------- */
    
    lv_obj_t * row8 = lv_obj_create(result.panel);
    lv_obj_set_size(row8, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row8, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row8, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row8, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row8, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row8, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row8,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row8, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row8, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row8, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row8, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding*2;
    label_width_1 = NULL;
    value_width_1 = NULL;
    
    // Map Mode
    result.mode = lv_label_create(row8);
    lv_label_set_text(result.mode, "Map Mode");
    lv_obj_set_size(result.mode, label_width_0, row_height);
    lv_obj_set_style_text_font(result.mode, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.mode, menu_text_color, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.mode, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    // Select Map Mode
    result.dd_mode = create_dropdown_menu(
        row8,
        NULL,
        0,
        value_width_0,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_mode_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MAP_MODES; i++) {
        snprintf(dd_mode_name, sizeof(dd_mode_name), "%s", String(mappingData.char_map_mode_names[i]).c_str()); // todo: make human map mode name array in mapping.cpp
        lv_dropdown_add_option(result.dd_mode, dd_mode_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_mode, 0);
    lv_obj_add_event_cb(result.dd_mode, dd_mode_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.mode, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_mode, value_width_0, LV_SIZE_CONTENT);

    /* --- ROW 9: Map Input Value --------------------------------------------------- */
    
    lv_obj_t * row9 = lv_obj_create(result.panel);
    lv_obj_set_size(row9, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row9, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row9, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row9, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row9, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row9, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row9,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row9, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row9, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row9, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row9, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding*4;
    label_width_1 = NULL;
    value_width_1 = NULL;

    result.input_value = lv_label_create(row9);
    lv_label_set_text(result.input_value, "Input Value");
    lv_obj_set_size(result.input_value, label_width_0, row_height);
    lv_obj_set_style_text_font(result.input_value, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.input_value, menu_text_color, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.input_value, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
