holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.value_input = lv_label_create(row9);
    lv_label_set_text(result.value_input, " - - -");
    lv_obj_set_size(result.value_input, value_width_0, row_height);
    lv_obj_set_style_text_font(result.value_input, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.value_input, menu_text_color, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.value_input, LV_TEXT_ALIGN_RIGHT, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_size(result.input_value, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.value_input, value_width_0, LV_SIZE_CONTENT);

    /* --- ROW 10: Map Result ---------------------------------------------------------- */
    
    lv_obj_t * row10 = lv_obj_create(result.panel);
    lv_obj_set_size(row10, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row10, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row10, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row10, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row10, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row10, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row10,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row10, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row10, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row10, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row10, LV_DIR_NONE);}

    label_width_0 = 200;
    value_width_0 = (width_px - label_width_0) - padding*4;
    label_width_1 = NULL;
    value_width_1 = NULL;

    result.map_result = lv_label_create(row10);
    lv_label_set_text(result.map_result, "Output Value");
    lv_obj_set_size(result.map_result, label_width_0, row_height);
    lv_obj_set_style_text_font(result.map_result, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.map_result, menu_text_color, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.map_result, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    result.value_map_result = lv_label_create(row10);
    lv_label_set_text(result.value_map_result, String(mappingData.mapped_value[0][matrixData.index_mapped_value[0][current_matrix_i]]).c_str());
    lv_obj_set_size(result.value_map_result, value_width_0, row_height);
    lv_obj_set_style_text_font(result.value_map_result, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.value_map_result, menu_text_color, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.value_map_result, LV_TEXT_ALIGN_RIGHT, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_size(result.map_result, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.value_map_result, value_width_0, LV_SIZE_CONTENT);

    return result;
}

/** ----------------------------------------------------------------------------------------
 * @brief Display image from SD card.
 * 
 * @param scr Pointer to the parent screen object.
 * @param filename Path to the image file on the SD card.
 * @param width_px Width of the image in pixels.
 * @param height_px Height of the image in pixels.
 * @param color_depth_bits Color depth of the image in bits (e.g., 16 for RGB565).
 * @param pos_x X position of the image within its parent/screen.
 * @param pos_y Y position of the image within its parent/screen.
 * @param alignment Alignment of the image within its parent/screen.
 * 
 * @note Requires sufficient external RAM (PSRAM) for all file bytes.
 * 
 */
sdcard_image_t * create_image_from_sdcard(
    lv_obj_t * scr,
    const char * filename,
    uint32_t width_px,
    uint32_t height_px,
    uint32_t color_depth_bits,
    uint32_t pos_x,
    uint32_t pos_y,
    int32_t alignment,
    bool discard_after_display
) {

    // Allocate sdcard_image_t structure
    sdcard_image_t * sdcard_image = (sdcard_image_t *)heap_caps_malloc(sizeof(sdcard_image_t), MALLOC_CAP_SPIRAM);
    if (!sdcard_image) {
        printf("ERROR: PSRAM allocation for sdcard_image_t failed\n");
        return NULL;
    }

    // Get file size
    sdcard_image->f_size = get_file_size(filename);
    if (sdcard_image->f_size == 0) {
        printf("ERROR: Cannot get size of %s\n", filename);
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Load image to PSRAM
    sdcard_image->bytes_in_psram = load_file_bytes_to_psram(filename, sdcard_image->f_size);
    if (!sdcard_image->bytes_in_psram) {
        printf("ERROR: Failed to load %s to PSRAM\n", filename);
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Create descriptor from loaded data
    sdcard_image->dsc.header.cf = color_depth_bits == 24 ? LV_COLOR_FORMAT_RGB565A8 : LV_COLOR_FORMAT_RGB565;
    sdcard_image->dsc.header.w = width_px;
    sdcard_image->dsc.header.h = height_px;
    sdcard_image->dsc.data_size = sdcard_image->f_size;
    sdcard_image->dsc.data = sdcard_image->bytes_in_psram; // Pointer to PSRAM data

    printf("Created image descriptor: cf=%d %ldx%ld size=%ld\n", 
           sdcard_image->dsc.header.cf, width_px, height_px, sdcard_image->f_size);

    // Create LVGL image object
    sdcard_image->lv_image_obj = lv_img_create(scr);
    if (!sdcard_image->lv_image_obj) {
        printf("ERROR: Failed to create LVGL image\n");
        heap_caps_free(sdcard_image->bytes_in_psram);
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Position and size
    lv_obj_set_pos(sdcard_image->lv_image_obj, pos_x, pos_y);
    if (alignment == LV_ALIGN_CENTER) {
        lv_obj_center(sdcard_image->lv_image_obj);
    }
    lv_obj_set_size(sdcard_image->lv_image_obj, width_px, height_px);
    
    // Set image source
    lv_img_set_src(sdcard_image->lv_image_obj, &sdcard_image->dsc);

    // Discard or return
    if (discard_after_display) {
        heap_caps_free(sdcard_image->bytes_in_psram);
        heap_caps_free(sdcard_image);
        printf("Discarded image data from PSRAM\n");
        return NULL;  // Return NULL when discarding
    }
    printf("Image created successfully at %p\n", sdcard_image);
    return sdcard_image;  // Return full structure
}

void cleanup_loading_image() {
    if (loading_image) {
        // Delete LVGL image object
        if (loading_image->lv_image_obj) {
            lv_obj_del(loading_image->lv_image_obj);
        }
        // Free PSRAM image data
        if (loading_image->bytes_in_psram) {
            heap_caps_free(loading_image->bytes_in_psram);
        }
        // Free the struct itself
        heap_caps_free(loading_image);
        loading_image = NULL;
        printf("Loading screen image cleaned up\n");
    }
}

void default_screen_objects(lv_obj_t * scr) {

    cleanup_loading_image();

