holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Always create a fresh screen
    disp_screen = lv_obj_create(NULL);

    default_screen_objects(disp_screen);

    lv_scr_load_anim(disp_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);  // last param = auto_del
    flag_display_disp_screen = false;
}

void display_system_screen() {

    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == system_screen) return;

    // Always create a fresh screen
    system_screen = lv_obj_create(NULL);

    default_screen_objects(system_screen);

    lv_scr_load_anim(system_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);  // last param = auto_del
    flag_display_system_screen = false;
}

void display__screen() {

    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == _screen) return;

    // Always create a fresh screen
    _screen = lv_obj_create(NULL);

    default_screen_objects(_screen);

    lv_scr_load_anim(_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);  // last param = auto_del
    flag_display__screen = false;
}

/** ---------------------------------------------------------------------------------------
 * @brief Update display
 */
char ui_buf_matrix[256];

void update_display_on_timer(lv_timer_t * timer) {
    LV_UNUSED(timer);
    update_display();
};

void update_display() {

    // pause timer...
    lv_timer_pause(display_timer);
    
    if (kb_alnumsym.kb != NULL && lv_obj_is_valid(kb_alnumsym.kb)) {
        if (!lv_obj_has_flag(kb_alnumsym.kb, LV_OBJ_FLAG_HIDDEN)) {
            // Rainbow keyboard full outline
            lv_obj_set_style_outline_color(kb_alnumsym.kb, lv_color_hsv_to_rgb((current_hue + 300) % 360, 100, 100), LV_PART_MAIN);
            // Rainbow keyboard full keys
            lv_obj_set_style_text_color(kb_alnumsym.kb, lv_color_hsv_to_rgb((current_hue + 75) % 360, 100, 100), LV_PART_ITEMS);
            // Rainbow keyboard full checked keys
            lv_obj_set_style_text_color(kb_alnumsym.kb, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_ITEMS | LV_STATE_CHECKED);
            // Rainbow keyboard full text area outline
            lv_obj_set_style_outline_color(kb_alnumsym.ta, lv_color_hsv_to_rgb((current_hue + 300) % 360, 100, 100), LV_PART_MAIN);
            // Rainbow keyboard full text area text
            lv_obj_set_style_text_color(kb_alnumsym.ta, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);
        }
    }

    if (kb_numdec.kb != NULL && lv_obj_is_valid(kb_numdec.kb)) {
        if (!lv_obj_has_flag(kb_numdec.kb, LV_OBJ_FLAG_HIDDEN)) {
            // Rainbow keyboard numdec full outline
            lv_obj_set_style_outline_color(kb_numdec.kb, lv_color_hsv_to_rgb((current_hue + 300) % 360, 100, 100), LV_PART_MAIN);
            // Rainbow keyboard numdec full keys
            lv_obj_set_style_text_color(kb_numdec.kb, lv_color_hsv_to_rgb((current_hue + 75) % 360, 100, 100), LV_PART_ITEMS);
            // Rainbow keyboard numdec full checked keys
            lv_obj_set_style_text_color(kb_numdec.kb, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_ITEMS | LV_STATE_CHECKED);
            // Rainbow keyboard numdec full text area outline
            lv_obj_set_style_outline_color(kb_numdec.ta, lv_color_hsv_to_rgb((current_hue + 300) % 360, 100, 100), LV_PART_MAIN);
            // Rainbow keyboard numdec full text area text
            lv_obj_set_style_text_color(kb_numdec.ta, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);
        }
    }
    
    // ---------------------
    // Title Bar
    // ---------------------

    if (main_title_bar.panel) {
        vTaskDelay(5 / portTICK_PERIOD_MS);

        // Title Bar Outline
        lv_obj_set_style_outline_color(main_title_bar.panel, lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100), LV_PART_MAIN);

        // Title Bar Local Time
        lv_label_set_text(main_title_bar.time_label, satioData.formatted_local_time_HHMMSS);
        lv_obj_set_style_text_color(main_title_bar.time_label, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);

        // Title Bar Local Date
        lv_label_set_text(main_title_bar.date_label, satioData.formatted_local_short_date_DDMMYY);
        lv_obj_set_style_text_color(main_title_bar.date_label, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);

        // GPS Sync
        if (satioData.gps_sync) {
            lv_obj_add_flag(main_title_bar.gps_signal_strength, LV_OBJ_FLAG_HIDDEN);
            lv_obj_remove_flag(main_title_bar.datetime_sync, LV_OBJ_FLAG_HIDDEN);
            lv_obj_set_style_outline_color(main_title_bar.datetime_sync, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.datetime_sync, lv_color_make(0, 255, 0), LV_PART_MAIN);
        }
        // GPS Signal
        else {
            lv_obj_add_flag(main_title_bar.datetime_sync, LV_OBJ_FLAG_HIDDEN);
            lv_obj_remove_flag(main_title_bar.gps_signal_strength, LV_OBJ_FLAG_HIDDEN);
            String gps_signal_text = "" + String(gnggaData.satellite_count) + ":" + String(gnggaData.gps_precision_factor) + "";
            lv_obj_set_style_outline_color(main_title_bar.gps_signal_strength, lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100), LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.gps_signal_strength, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);
            lv_label_set_text(main_title_bar.gps_signal_strength, gps_signal_text.c_str());
        }

        // SD Card Mounted / Success Flag
        if (sdcardFlagData.success_flag==2) {
            lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_label_set_text(main_title_bar.sdcard_mounted, "ok");
        }
        else if (sdcardFlagData.success_flag==1) {
            lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, lv_color_make(255, 0, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, lv_color_make(255, 0, 0), LV_PART_MAIN);
            lv_label_set_text(main_title_bar.sdcard_mounted, "!");
        }
        else {
            if (sdcardData.sdcard_mounted) {
                lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100), LV_PART_MAIN);
                lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);
                lv_label_set_text(main_title_bar.sdcard_mounted, "SD");
            }
            else {
                lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100), LV_PART_MAIN);
                lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);
                lv_label_set_text(main_title_bar.sdcard_mounted, "SD!");
            }
        }
    }

    // ---------------------
    // System Tray
    // ---------------------
    if (system_tray.is_open) {
        vTaskDelay(5 / portTICK_PERIOD_MS);

        // Rainbow System Tray Outline
        lv_obj_set_style_outline_color(system_tray.panel, lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100), LV_PART_MAIN);

        // Rainbow System Tray Brightness Slider Outline
        lv_obj_set_style_outline_color(system_tray.slider_brightness, lv_color_hsv_to_rgb((current_hue + 300) % 360, 100, 100), LV_PART_MAIN);

        // Rainbow System Tray Brightness Slider Knob
        lv_obj_set_style_bg_color(system_tray.slider_brightness, lv_color_hsv_to_rgb((current_hue + 200) % 360, 100, 100), LV_PART_KNOB);

        // Rainbow System Tray Brightness Slider Indicator
        lv_obj_set_style_outline_color(system_tray.slider_brightness, lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100), LV_PART_INDICATOR);

