holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        // System Tray Local Time
        lv_label_set_text(system_tray.local_time, satioData.formatted_local_time_HHMMSS);
        lv_obj_set_style_text_color(system_tray.local_time, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);

        // System Tray Local Date
        lv_label_set_text(system_tray.local_date, satioData.formatted_local_short_date_DDMMYY);
        lv_obj_set_style_text_color(system_tray.local_date, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);

        // System Tray Human Date
        String human_date = String(satioData.local_wday_name) + " " + String(satioData.local_mday) + " " + String(satioData.local_month_name);
        // printf("human date: %s\n", human_date.c_str());
        lv_label_set_text(system_tray.human_date, human_date.c_str());
        lv_obj_set_style_text_color(system_tray.human_date, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);

        // GPS Sync
        if (satioData.gps_sync) {
            lv_obj_add_flag(system_tray.gps_signal_strength, LV_OBJ_FLAG_HIDDEN);
            lv_obj_remove_flag(system_tray.datetime_sync, LV_OBJ_FLAG_HIDDEN);
            lv_obj_set_style_outline_color(system_tray.datetime_sync, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(system_tray.datetime_sync, lv_color_make(0, 255, 0), LV_PART_MAIN);
        }
        // GPS Signal
        else {
            lv_obj_add_flag(system_tray.datetime_sync, LV_OBJ_FLAG_HIDDEN);
            lv_obj_remove_flag(system_tray.gps_signal_strength, LV_OBJ_FLAG_HIDDEN);
            String gps_signal_text = "" + String(gnggaData.satellite_count) + ":" + String(gnggaData.gps_precision_factor) + "";
            lv_obj_set_style_outline_color(system_tray.gps_signal_strength, lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100), LV_PART_MAIN);
            lv_obj_set_style_text_color(system_tray.gps_signal_strength, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);
            lv_label_set_text(system_tray.gps_signal_strength, gps_signal_text.c_str());
        }

        // SD Card Mounted / Success Flag
        if (sdcardFlagData.success_flag==2) {
            lv_obj_set_style_outline_color(system_tray.sdcard_mounted, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(system_tray.sdcard_mounted, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_label_set_text(system_tray.sdcard_mounted, "ok");
        }
        else if (sdcardFlagData.success_flag==1) {
            lv_obj_set_style_outline_color(system_tray.sdcard_mounted, lv_color_make(255, 0, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(system_tray.sdcard_mounted, lv_color_make(255, 0, 0), LV_PART_MAIN);
            lv_label_set_text(system_tray.sdcard_mounted, "!");
        }
        else {
            if (sdcardData.sdcard_mounted) {
                lv_obj_set_style_outline_color(system_tray.sdcard_mounted, lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100), LV_PART_MAIN);
                lv_obj_set_style_text_color(system_tray.sdcard_mounted, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);
                lv_label_set_text(system_tray.sdcard_mounted, "SD");
            }
            else {
                lv_obj_set_style_outline_color(system_tray.sdcard_mounted, lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100), LV_PART_MAIN);
                lv_obj_set_style_text_color(system_tray.sdcard_mounted, lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100), LV_PART_MAIN);
                lv_label_set_text(system_tray.sdcard_mounted, "SD!");
            }
        }

        // Grid Menu 1
        if (system_tray.grid_menu_1) {
            vTaskDelay(5 / portTICK_PERIOD_MS);

            uint32_t grid_child_cnt = lv_obj_get_child_cnt(system_tray.grid_menu_1);
            for(uint32_t i = 0; i < grid_child_cnt; i++) {
                lv_obj_t * btn = lv_obj_get_child(system_tray.grid_menu_1, i);
                lv_obj_set_style_outline_color(btn, lv_color_hsv_to_rgb((current_hue + 300) % 360, 100, 100), LV_PART_MAIN);
                // Get label
                lv_obj_t * label = lv_obj_get_child(btn, 0);
                if(label && lv_obj_has_class(label, &lv_label_class)) {
                    // Color label
                    lv_obj_set_style_text_color(label, 
                        lv_color_hsv_to_rgb((current_hue + (i * 60)) % 360, 100, 100), LV_PART_MAIN);
                }
            }
        }
    }

    if (flag_display_home_screen==true) {display_home_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_matrix_screen==true) {display_matrix_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_gps_screen==true) {display_gps_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_gyro_screen==true) {display_gyro_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_disp_screen==true) {display_disp_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_system_screen==true) {display_system_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display__screen==true) {display__screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}

    // loading screen
    if (lv_scr_act() == loading_screen) {
    }

    // main screen
    else if (lv_scr_act() == home_screen) {
    }

    // matrix screen
    else if (lv_scr_act() == matrix_screen) {

        matrix_contrast_outline_color = lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100);
        matrix_value_title_text_color = lv_color_hsv_to_rgb((current_hue + 150) % 360, 100, 100);
        matrix_value_text_color = lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100);
        matrix_contrast_value_text_color = lv_color_hsv_to_rgb((current_hue + 150) % 360, 100, 100);

        map_value_title_text_color = lv_color_hsv_to_rgb((current_hue + 150) % 360, 100, 100);
        map_value_text_color = lv_color_hsv_to_rgb((current_hue + 0) % 360, 100, 100);
        map_contrast_value_text_color = lv_color_hsv_to_rgb((current_hue + 150) % 360, 100, 100);

        // Matrix Overview Grid 1
        if (matrix_overview_grid_1) {
            vTaskDelay(5 / portTICK_PERIOD_MS);

