holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
            uint32_t grid_child_cnt = lv_obj_get_child_cnt(matrix_overview_grid_1);
            for(uint32_t i = 0; i < grid_child_cnt; i++) {
                lv_obj_t * btn = lv_obj_get_child(matrix_overview_grid_1, i);

                /* Computer Assist (yellow outline) */
                if (matrixData.computer_assist[0][i]==true) {lv_obj_set_style_outline_color(btn, lv_color_make(255, 255, 0), LV_PART_MAIN);}
                else {lv_obj_set_style_outline_color(btn, lv_color_make(58, 58, 58), LV_PART_MAIN);}

                lv_obj_t * label = lv_obj_get_child(btn, 0);
                if(label && lv_obj_has_class(label, &lv_label_class)) {

                    /* Switch Intention (blue text) */
                    if (matrixData.switch_intention[0][i]==true) {lv_obj_set_style_text_color(label, lv_color_make(0, 0, 255), LV_PART_MAIN);}
                    else {
                        /* Computer Intention (yellow text) */
                        if (matrixData.computer_intention[0][i]==true) {lv_obj_set_style_text_color(label, lv_color_make(255, 255, 0), LV_PART_MAIN);}
                        else {lv_obj_set_style_text_color(label, lv_color_make(58, 58, 58), LV_PART_MAIN);}
                    }
                }
            }
        }
        
        // Matrix Save Slot
        if (dd_matrix_file_slot_select) {
            for (int i=0; i<MAX_MATRIX_SLOTS; i++) {
                if (strcmp(satioFileData.current_matrix_filepath, satioFileData.matix_filepaths[i])==0) {
                    lv_dropdown_set_selected(dd_matrix_file_slot_select, i);
                    break;
                }
            }
            lv_dropdown_set_selected(dd_matrix_file_slot_select, current_matrix_function_i);
            lv_obj_set_style_outline_color(dd_matrix_file_slot_select, lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100), LV_PART_MAIN);
            lv_obj_set_style_text_color(dd_matrix_file_slot_select, map_value_text_color, LV_PART_MAIN);
            lv_obj_set_style_outline_color(lv_dropdown_get_list(dd_matrix_file_slot_select), matrix_contrast_outline_color, LV_PART_MAIN);
            lv_obj_set_style_text_color(lv_dropdown_get_list(dd_matrix_file_slot_select), map_value_text_color, LV_PART_MAIN);
            lv_obj_set_style_text_color(lv_dropdown_get_list(dd_matrix_file_slot_select), map_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
            lv_obj_set_style_text_color(lv_dropdown_get_list(dd_matrix_file_slot_select), map_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);
        }

        // Matrix New
        if (matrix_new.panel) {
            lv_obj_set_style_outline_color(matrix_new.panel, lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100), LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_new.label, lv_color_hsv_to_rgb((current_hue + 150) % 360, 100, 100), LV_PART_MAIN);
        }

        // Matrix Save
        if (matrix_save.panel) {
            lv_obj_set_style_outline_color(matrix_save.panel, lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100), LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_save.label, lv_color_hsv_to_rgb((current_hue + 150) % 360, 100, 100), LV_PART_MAIN);
        }

        // Matrix Load
        if (matrix_load.panel) {
            lv_obj_set_style_outline_color(matrix_load.panel, lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100), LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_load.label, lv_color_hsv_to_rgb((current_hue + 150) % 360, 100, 100), LV_PART_MAIN);
        }

        // Matrix Delete
        if (matrix_delete.panel) {
            lv_obj_set_style_outline_color(matrix_delete.panel, lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100), LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_delete.label, lv_color_hsv_to_rgb((current_hue + 150) % 360, 100, 100), LV_PART_MAIN);
        }

        // Switch Main Matrix Panel (Matrix/Mapping)
        if (switch_matrix_mapping_panel.label) {
            if (current_matrix_panel_view==0) {lv_label_set_text(switch_matrix_mapping_panel.label, "MATRIX");}
            else if (current_matrix_panel_view==1) {lv_label_set_text(switch_matrix_mapping_panel.label, "MAP");}
            else {lv_label_set_text(switch_matrix_mapping_panel.label, "");}
            lv_obj_set_style_outline_color(switch_matrix_mapping_panel.panel, lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100), LV_PART_MAIN);
            lv_obj_set_style_text_color(switch_matrix_mapping_panel.label, lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100), LV_PART_MAIN);
        }
        
        // Matrix Configuration Panel
        if (current_matrix_panel_view==0) {
            if (mfc.panel) {

                // Hide Matrix Configuration Panel
                lv_obj_add_flag(mcc.panel, LV_OBJ_FLAG_HIDDEN); 

                // Show Computer Assist Panel
                lv_obj_remove_flag(mfc.matrix_switch_computer_assist.panel, LV_OBJ_FLAG_HIDDEN);
                // Show Matrix Switch Override Panel
                lv_obj_remove_flag(mfc.matrix_switch_override.panel, LV_OBJ_FLAG_HIDDEN);
                // Show Matrix Switch Output Value Panel
                lv_obj_remove_flag(mfc.matrix_switch_output_value, LV_OBJ_FLAG_HIDDEN);

                // Show Matrix Configuration Panel
                lv_obj_remove_flag(mfc.panel, LV_OBJ_FLAG_HIDDEN);

                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Panel
                lv_obj_set_style_outline_color(mfc.panel, lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100), LV_PART_MAIN);

                // Label Current Function
                lv_obj_set_style_text_color(mfc.label_function_index_select, matrix_value_title_text_color, LV_PART_MAIN);
                // Value Current Function
                lv_dropdown_set_selected(mfc.dd_function_index_select, current_matrix_function_i);
                lv_obj_set_style_text_color(mfc.dd_function_index_select, matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_function_index_select), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_function_index_select), matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_function_index_select), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_function_index_select), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // Label Primary Function Comparotor
                lv_obj_set_style_text_color(mfc.label_function_name, matrix_value_title_text_color, LV_PART_MAIN);
                // Value Primary Function Comparotor
                lv_dropdown_set_selected(mfc.dd_function_name, matrixData.matrix_function[0][current_matrix_i][current_matrix_function_i]);
                lv_obj_set_style_text_color(mfc.dd_function_name, matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_function_name), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_function_name), matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_function_name), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_function_name), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // X
                lv_obj_set_style_text_color(mfc.label_x, matrix_value_title_text_color, LV_PART_MAIN);

                // X Comparitor Mode
                lv_dropdown_set_selected(mfc.dd_mode_x, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]);
                lv_obj_set_style_text_color(mfc.dd_mode_x, matrix_value_title_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_mode_x), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_x), matrix_value_title_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_x), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_x), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);
                // X Value
                if (matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]==0) {
                    // Mode 0: User Defined
                    lv_textarea_set_text(mfc.ta_x, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]).c_str());
                    lv_obj_add_flag(mfc.dd_x, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.ta_x, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_set_style_text_color(mfc.ta_x, matrix_value_text_color, LV_PART_MAIN);
                }
                else {
                    // Mode 1: System Defined
                    lv_dropdown_set_selected(mfc.dd_x, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]);
                    lv_obj_add_flag(mfc.ta_x, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.dd_x, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_set_style_text_color(mfc.dd_x, matrix_value_text_color, LV_PART_MAIN);
                    lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_x), matrix_contrast_outline_color, LV_PART_MAIN);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_x), matrix_value_text_color, LV_PART_MAIN);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_x), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_x), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);
                }

                // Y
                lv_obj_set_style_text_color(mfc.label_y, matrix_value_title_text_color, LV_PART_MAIN);

