holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // Y Comparitor Mode
                lv_dropdown_set_selected(mfc.dd_mode_y, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]);
                lv_obj_set_style_text_color(mfc.dd_mode_y, matrix_value_title_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_mode_y), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_y), matrix_value_title_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_y), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_y), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);
                // Y Value
                if (matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]==0) {
                    // Mode 0: User Defined
                    lv_textarea_set_text(mfc.ta_y, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]).c_str());
                    lv_obj_add_flag(mfc.dd_y, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.ta_y, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_set_style_text_color(mfc.ta_y, matrix_value_text_color, LV_PART_MAIN);
                }
                else {
                    // Mode 1: System Defined
                    lv_dropdown_set_selected(mfc.dd_y, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]);
                    lv_obj_add_flag(mfc.ta_y, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.dd_y, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_set_style_text_color(mfc.dd_y, matrix_value_text_color, LV_PART_MAIN);
                    lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_y), matrix_contrast_outline_color, LV_PART_MAIN);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_y), matrix_value_text_color, LV_PART_MAIN);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_y), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_y), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);
                }

                // Z
                lv_obj_set_style_text_color(mfc.label_z, matrix_value_title_text_color, LV_PART_MAIN);
                // Z Comparitor Mode
                lv_dropdown_set_selected(mfc.dd_mode_z, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]);
                lv_obj_set_style_text_color(mfc.dd_mode_z, matrix_value_title_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_mode_z), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_z), matrix_value_title_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_z), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_mode_z), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);
                // Z Value
                if (matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]==0) {
                    // Mode 0: User Defined
                    lv_textarea_set_text(mfc.ta_z, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]).c_str());
                    lv_obj_add_flag(mfc.dd_z, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.ta_z, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_set_style_text_color(mfc.ta_z, matrix_value_text_color, LV_PART_MAIN);
                }
                else {
                    // Mode 1: System Defined
                    lv_dropdown_set_selected(mfc.dd_z, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]);
                    lv_obj_add_flag(mfc.ta_z, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_remove_flag(mfc.dd_z, LV_OBJ_FLAG_HIDDEN);
                    lv_obj_set_style_text_color(mfc.dd_z, matrix_value_text_color, LV_PART_MAIN);
                    lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_z), matrix_contrast_outline_color, LV_PART_MAIN);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_z), matrix_value_text_color, LV_PART_MAIN);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_z), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                    lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_z), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);
                }

                // Operator
                lv_obj_set_style_text_color(mfc.label_operator, matrix_value_title_text_color, LV_PART_MAIN);
                lv_dropdown_set_selected(mfc.dd_operator, matrixData.matrix_switch_operator_index[0][current_matrix_i][current_matrix_function_i]);
                lv_obj_set_style_text_color(mfc.dd_operator, matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_operator), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_operator), matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_operator), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_operator), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // Output Mode
                lv_obj_set_style_text_color(mfc.label_output_mode, matrix_value_title_text_color, LV_PART_MAIN);
                lv_dropdown_set_selected(mfc.dd_output_mode, matrixData.output_mode[0][current_matrix_i]);
                lv_obj_set_style_text_color(mfc.dd_output_mode, matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_output_mode), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_output_mode), matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_output_mode), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_output_mode), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);

