holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // PWM Off
                lv_obj_set_style_text_color(mfc.label_output_pwm_0, matrix_value_title_text_color, LV_PART_MAIN);
                lv_textarea_set_text(mfc.ta_pwm_0, String(matrixData.output_pwm[0][current_matrix_i][0]).c_str());
                lv_obj_set_style_text_color(mfc.ta_pwm_0, matrix_value_text_color, LV_PART_MAIN);

                // PWM On
                lv_obj_set_style_text_color(mfc.label_output_pwm_1, matrix_value_title_text_color, LV_PART_MAIN);
                lv_textarea_set_text(mfc.ta_pwm_1, String(matrixData.output_pwm[0][current_matrix_i][1]).c_str());
                lv_obj_set_style_text_color(mfc.ta_pwm_1, matrix_value_text_color, LV_PART_MAIN);

                // Connected Map Slot
                lv_obj_set_style_text_color(mfc.label_map_slot, matrix_value_title_text_color, LV_PART_MAIN);
                lv_dropdown_set_selected(mfc.dd_map_slot, matrixData.index_mapped_value[0][current_matrix_i]);
                lv_obj_set_style_text_color(mfc.dd_map_slot, matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mfc.dd_map_slot), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_map_slot), matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_map_slot), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mfc.dd_map_slot), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);

                // Output Port
                lv_obj_set_style_text_color(mfc.label_port_map, matrix_value_title_text_color, LV_PART_MAIN);
                lv_textarea_set_text(mfc.ta_port_map, String(matrixData.matrix_port_map[0][current_matrix_i]).c_str());
                lv_obj_set_style_text_color(mfc.ta_port_map, matrix_value_text_color, LV_PART_MAIN);

                // Computer Assist
                if (mfc.matrix_switch_computer_assist.panel) {
                    if (matrixData.computer_assist[0][current_matrix_i]==true) {
                        lv_obj_set_style_outline_color(mfc.matrix_switch_computer_assist.panel, lv_color_make(255, 255, 0), LV_PART_MAIN);
                        lv_obj_set_style_text_color(mfc.matrix_switch_computer_assist.label, lv_color_make(255, 255, 0), LV_PART_MAIN);
                    }
                    else {
                        lv_obj_set_style_outline_color(mfc.matrix_switch_computer_assist.panel, lv_color_make(58, 58, 58), LV_PART_MAIN);
                        lv_obj_set_style_text_color(mfc.matrix_switch_computer_assist.label, lv_color_make(58, 58, 58), LV_PART_MAIN);
                    }
                }

                // Override
                if (mfc.matrix_switch_override.panel) {
                    lv_obj_set_style_outline_color(mfc.matrix_switch_override.panel, lv_color_make(255, 0, 0), LV_PART_MAIN);
                    lv_obj_set_style_text_color(mfc.matrix_switch_override.label, lv_color_make(255, 0, 0), LV_PART_MAIN);
                }

                // Output Value
                if (mfc.matrix_switch_output_value) {
                    lv_obj_set_style_outline_color(mfc.matrix_switch_output_value, lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100), LV_PART_MAIN);
                    lv_label_set_text(mfc.matrix_switch_output_value, String(String("") + String(matrixData.output_value[0][current_matrix_i])).c_str());
                    /* Text Color: Switch Intention (blue) */
                    if (matrixData.switch_intention[0][current_matrix_i]==true) {lv_obj_set_style_text_color(mfc.matrix_switch_output_value, lv_color_make(0, 0, 255), LV_PART_MAIN);}
                    else {
                        /* Text Color: Computer Intention (yellow) */
                        if (matrixData.computer_intention[0][current_matrix_i]==true) {lv_obj_set_style_text_color(mfc.matrix_switch_output_value, lv_color_make(255, 255, 0), LV_PART_MAIN);}
                        else {lv_obj_set_style_text_color(mfc.matrix_switch_output_value, lv_color_make(58, 58, 58), LV_PART_MAIN);}
                    }
                }
            }
        }

        // Mapping Configuration Panel
        if (current_matrix_panel_view==1) {
            if (mcc.panel) {

                // Hide Computer Assist Panel
                lv_obj_add_flag(mfc.matrix_switch_computer_assist.panel, LV_OBJ_FLAG_HIDDEN);
                // Hide Matrix Switch Override Panel
                lv_obj_add_flag(mfc.matrix_switch_override.panel, LV_OBJ_FLAG_HIDDEN);
                // Hide Matrix Switch Output Value Panel
                lv_obj_add_flag(mfc.matrix_switch_output_value, LV_OBJ_FLAG_HIDDEN);

                // Hide Matrix Configuration Panel
                lv_obj_add_flag(mfc.panel, LV_OBJ_FLAG_HIDDEN);

                // Show Mapping Configuration Panel
                lv_obj_remove_flag(mcc.panel, LV_OBJ_FLAG_HIDDEN);

                vTaskDelay(5 / portTICK_PERIOD_MS);

                // Panel
                lv_obj_set_style_outline_color(mcc.panel, lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100), LV_PART_MAIN);

                // Map Slot
                lv_obj_set_style_text_color(mcc.slot, map_value_title_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(mcc.dd_slot, matrix_value_title_text_color, LV_PART_MAIN);
                lv_dropdown_set_selected(mcc.dd_slot, current_mapping_i);
                lv_obj_set_style_text_color(mcc.dd_slot, matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mcc.dd_slot), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_slot), matrix_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_slot), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_slot), matrix_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);

