holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // Map Mode 0
                if (mappingData.map_mode[0][current_mapping_i]==MAP_MODE_MIN_TO_MAX) {
                    // C0
                    lv_label_set_text(mcc.c0, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C0]).c_str());
                    // C1
                    lv_label_set_text(mcc.c1, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C1]).c_str());
                    // C2
                    lv_label_set_text(mcc.c2, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C2]).c_str());
                    // C3
                    lv_label_set_text(mcc.c3, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C3]).c_str());
                    // C4
                    lv_label_set_text(mcc.c4, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C4]).c_str());
                    // C5
                    lv_label_set_text(mcc.c5, String(mappingData.char_map_mode_config_names[MAP_MODE_MIN_TO_MAX][INDEX_MAP_C5]).c_str());
                }
                // Map Mode 1
                else if (mappingData.map_mode[0][current_mapping_i]==MAP_MODE_CENTER_MAP_AXIS_0) {
                    // C0
                    lv_label_set_text(mcc.c0, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C0]).c_str());
                    // C1
                    lv_label_set_text(mcc.c1, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C1]).c_str());
                    // C2
                    lv_label_set_text(mcc.c2, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C2]).c_str());
                    // C3
                    lv_label_set_text(mcc.c3, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C3]).c_str());
                    // C4
                    lv_label_set_text(mcc.c4, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C4]).c_str());
                    // C5
                    lv_label_set_text(mcc.c5, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_0][INDEX_MAP_C5]).c_str());
                }
                // Map Mode 2
                else if (mappingData.map_mode[0][current_mapping_i]==MAP_MODE_CENTER_MAP_AXIS_1) {
                    // C0
                    lv_label_set_text(mcc.c0, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C0]).c_str());
                    // C1
                    lv_label_set_text(mcc.c1, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C1]).c_str());
                    // C2
                    lv_label_set_text(mcc.c2, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C2]).c_str());
                    // C3
                    lv_label_set_text(mcc.c3, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C3]).c_str());
                    // C4
                    lv_label_set_text(mcc.c4, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C4]).c_str());
                    // C5
                    lv_label_set_text(mcc.c5, String(mappingData.char_map_mode_config_names[MAP_MODE_CENTER_MAP_AXIS_1][INDEX_MAP_C5]).c_str());
                }

                lv_obj_set_style_text_color(mcc.c0, map_value_title_text_color, LV_PART_MAIN);
                lv_dropdown_set_selected(mcc.dd_c0, (int)mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C0]);
                lv_obj_set_style_text_color(mcc.dd_c0, map_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mcc.dd_c0), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_c0), map_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_c0), map_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_c0), map_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);

                lv_obj_set_style_text_color(mcc.c1, map_value_title_text_color, LV_PART_MAIN);
                lv_textarea_set_text(mcc.ta_c1, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C1]).c_str());
                lv_obj_set_style_text_color(mcc.ta_c1, map_value_text_color, LV_PART_MAIN);

                lv_obj_set_style_text_color(mcc.c2, map_value_title_text_color, LV_PART_MAIN);
                lv_textarea_set_text(mcc.ta_c2, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C2]).c_str());
                lv_obj_set_style_text_color(mcc.ta_c2, map_value_text_color, LV_PART_MAIN);

                lv_obj_set_style_text_color(mcc.c3, map_value_title_text_color, LV_PART_MAIN);
                lv_textarea_set_text(mcc.ta_c3, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C3]).c_str());
                lv_obj_set_style_text_color(mcc.ta_c3, map_value_text_color, LV_PART_MAIN);

                lv_obj_set_style_text_color(mcc.c4, map_value_title_text_color, LV_PART_MAIN);
                lv_textarea_set_text(mcc.ta_c4, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C4]).c_str());
                lv_obj_set_style_text_color(mcc.ta_c4, map_value_text_color, LV_PART_MAIN);
                
                lv_obj_set_style_text_color(mcc.c5, map_value_title_text_color, LV_PART_MAIN);
                lv_textarea_set_text(mcc.ta_c5, String(mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C5]).c_str());
                lv_obj_set_style_text_color(mcc.ta_c5, map_value_text_color, LV_PART_MAIN);

                lv_obj_set_style_text_color(mcc.mode, map_value_title_text_color, LV_PART_MAIN);
                lv_dropdown_set_selected(mcc.dd_mode, mappingData.map_mode[0][current_mapping_i]);
                lv_obj_set_style_text_color(mcc.dd_mode, map_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_outline_color(lv_dropdown_get_list(mcc.dd_mode), matrix_contrast_outline_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_mode), map_value_text_color, LV_PART_MAIN);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_mode), map_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_CHECKED);
                lv_obj_set_style_text_color(lv_dropdown_get_list(mcc.dd_mode), map_contrast_value_text_color, LV_PART_SELECTED | LV_STATE_DEFAULT);

                lv_obj_set_style_text_color(mcc.input_value, map_value_title_text_color, LV_PART_MAIN);
                lv_label_set_text(mcc.value_input, String(get_mapping_input_value(current_mapping_i)).c_str());
                lv_obj_set_style_text_color(mcc.value_input, map_value_text_color, LV_PART_MAIN);

                lv_obj_set_style_text_color(mcc.map_result, map_value_title_text_color, LV_PART_MAIN);
                lv_label_set_text(mcc.value_map_result, String(mappingData.mapped_value[0][current_mapping_i]).c_str());
                lv_obj_set_style_text_color(mcc.value_map_result, map_value_text_color, LV_PART_MAIN);
            }
        }
    }

