holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Increment
    current_hue = (current_hue + 1) % 360;

    lv_timer_resume(display_timer);
}

void initSatIOUI() {
    // --------------------------------------------------------------
    // LVGL Initialization
    // --------------------------------------------------------------
    ESP_LOGI("LVGL", "Version: %d.%d.%d", LVGL_VERSION_MAJOR, LVGL_VERSION_MINOR, LVGL_VERSION_PATCH);
    
    // Initialize LVGL display object via BSP
    lv_display_t *disp = bsp_display_start();
    if (!disp) {ESP_LOGE("APP", "Failed to initialize display");}
    ESP_LOGI("APP", "Display initialized successfully");
    
    // Give BSP task time to fully initialize LVGL
    vTaskDelay(pdMS_TO_TICKS(1000));

    // Set LVGL tick period
    lv_timer_set_period(lv_timer_get_next(NULL), 50);  // ms

    // Set screens
    loading_screen = lv_obj_create(NULL);
    home_screen = lv_obj_create(NULL);
    matrix_screen = lv_obj_create(NULL);
    gps_screen = lv_obj_create(NULL);
    gyro_screen = lv_obj_create(NULL);
    disp_screen = lv_obj_create(NULL);
    system_screen = lv_obj_create(NULL);
    _screen = lv_obj_create(NULL);
    
    // Initialize display brightness and backlight
    bsp_display_brightness_init();
    bsp_display_backlight_on();
    slider_brightness_value = 80;
    bsp_display_brightness_set(slider_brightness_value);

    // Menu styling (menus are bootstrapped for consistant reproducibility so minimal styling is needed here)
    font_menu_title = &cobalt_alien_25;
    font_menu_item = &cobalt_alien_17;
    system_tray_bg_color = lv_color_make(10,10,10);
    menu_bg_color        = lv_color_make(0,0,0);
    menu_border_color    = lv_color_make(0,0,0); // hidden by making same as bg
    menu_outline_color   = lv_color_make(0,0,0);    // used instead of border
    menu_shadow_color    = lv_color_make(0,0,0);
    menu_text_color      = lv_color_make(0,255,0);

    // --------------------------------------------------------------
    // SD Card Initialization
    // --------------------------------------------------------------
    mount_sd();
    
    is_fs_ready("/sdcard"); // check mount
    
    list_directory("/sdcard"); // check read sdcard
    
    delay(1000);

    sd_lvgl_register(); // register file related callback functions with LVGL

    // --------------------------------------------------------------
    // Display Loading Screen
    // --------------------------------------------------------------
    display_loading_screen();
}

void satio_ui_begin() {
    display_timer = lv_timer_create(update_display_on_timer, 50, NULL);
}
